g_yijiEvents = ["嫁娶","订盟","纳采","裁衣","合帐","挽面","纳婿","祭祀","祈福","斋醮","安香","求嗣","开光","塑绘","谢土","解除","造庙","造桥","拆卸","修造","动土","破土","安门","作厕","移徙","筑堤","入宅","出火","作灶","开池","伐木","冠笄","问名","安床","开容","启攒","起基","修坟","安葬","立碑","入殓","移柩","成服","除服","交易","开市","纳财","立券","作染","鼓铸","酝酿","造船","买车","挂匾","分居","出行","入学","沐浴","理发","赴任","求医","捕捉","割蜜","取渔","栽种","结网","牧养","纳畜","破屋","坏垣","竖柱","上梁","开渠","掘井","扫舍","探病","酬神","雕刻","见贵","开仓","习艺","雇庸","置产","造屋","合脊","架马","定磉","作梁","补垣","塞穴","针灸","经络","治病","词讼","畋猎","造仓","乘船","放水","渡水","修门","扫舍","进人口","会亲友","安碓硙","开生坟","合寿木","教牛马","出货财","开柱眼","安机械","造车器","修饰垣墙","平治道涂","整手足甲","造畜椆栖"];
g_yijiEventsExplain = [["嫁娶","男娶女嫁，举行结婚大典的吉日"],
["订盟","订婚仪式的一种，俗称小聘(订)"],
["纳采","缔结婚姻的仪式、受授聘金"],
["裁衣","裁製新娘衣服或製作寿衣"],
["合帐","製作蚊帐之事"],
["纳婿","指男方入赘于女方为婿之意。同嫁娶"],
["祭祀","指祠堂之祭祀、即拜祭祖先或庙寺的祭拜、拜神明等事"],
["祈福","祈求神明降福或设醮还愿之事"],
["斋醮","庙宇建醮前需举行的斋戒仪式"],
["安香","安土地公或祖先之神位"],
["求嗣","指向神明祈求后嗣（子孙）之意"],
["开光","神佛像塑成后、供奉上位之事"],
["塑绘","寺庙之绘尽或雕刻神像、画雕人像等"],
["谢土","建筑物完工后所举行的祭祀"],
["解除","扫舍；指冲洗宅舍、解除灾厄"],
["造庙","建造寺、庙、宫、观、堂"],
["造桥","建造桥梁"],
["拆卸","就是拆掉建筑物。也就是我们常说的扒房子"],
["修造","也就是阳宅的修造与修理"],
["动土","指阳宅建筑时开工动起锄头挖土。即「破土」属阴宅，「动土」指阳宅也"],
["破土","仅指阴宅埋葬用的破土，与阳宅建筑房屋的「动土」不同。即「破土」属阴宅，「动土」指阳宅也"],
["安门","房屋装设门户等工事"],
["作厕","建造或修改厕所，古代包括厕道，现在包括排污管"],
["移徙","指搬家迁移入住所(含非新宅)之意"],
["筑堤","修筑堤防"],
["入宅","即迁入新宅、所谓“新居落成典礼”也。新居建成，或是旧家搬到新家去了，一个典礼"],
["出火","谓移动神位，「火」指「香火」而言"],
["作灶","指安修厨灶、厨炉移位"],
["冠笄","「冠」指男、「笄」指女、举行男女成人的仪式、称之为冠笄"],
["安床","指安置睡床卧铺之意"],
["开容","整容、挽面古代指新娘出嫁前，请人用线拔除脸上毫毛。现代可指新娘美容或化妆"],
["启攒","指坟墓「洗骨」之事。俗谓「拾金」也"],
["启钻","指坟墓「洗骨」之事。俗谓「拾金」也"],
["起基","建筑时、第一次动起锄头挖土"],
["修坟","修理坟墓"],
["安葬","举行埋葬等仪式"],
["立碑","立墓碑或纪念碑"],
["入殓","入殓就是将尸体放入棺材之意"],
["移柩","举行葬仪时、将棺木移出屋外之事"],
["成服","穿上丧服"],
["除服","脱下丧服"],
["交易","订立各种契约互相买卖之事"],
["开市","开业之意。商店行号开张做生意。「开幕礼」「开工」同"],
["纳财","指已属于自己的财富基础上购置产业、进货、收帐、收租、讨债、贷款、五谷入仓等"],
["立券","交易、订立各种契约互相买卖之事"],
["酝酿","指酿酒、造酱料等事"],
["挂匾","指悬挂招牌或各种匾额"],
["分居","指大家庭分家、各自另起炉灶之意"],
["出行","指外出旅行、观光游览"],
["沐浴","指沐浴斋戒而言"],
["理发","仅指初生婴儿第一次剃胎发或出家之落"],
["赴任","走马上任"],
["捕捉","扑灭农作物害虫或生物"],
["栽种","种植物「接果」「种田禾」同"],
["纳畜","买入家畜饲养之事"],
["破屋","坏垣、拆卸;拆除房屋或围墙"],
["竖柱","架马俗称起工架马；指建筑场所之鹰架"],
["上梁","装上建筑物屋顶的大梁，西式建筑指屋顶之灌浆(预拌混凝土)"],
["掘井","开渠、筑阴沟、开鱼池;开凿水井、池塘"],
["酬神","还愿，答谢神恩"],
["开仓","出货财、商家之出货、销货、放债"],
["习艺","学习特殊技艺，行拜师礼"],
["定磉","盖房破土动工后要定朝向,立合砖"],
["作梁","指砍伐树木作屋梁"],
["补垣","塞穴、填坑、覆井；塞穴指堵塞洞穴或蚁穴"],
["塞穴","指堵塞洞穴或蚁穴等"],
["经络","安机器、织布、收蚕、安纺车、机器"],
["词讼","打官司"],
["畋猎","打猎或捕捉禽兽"],
["造仓","建筑仓库或修理仓库"],
["放水","建筑、清理池塘或水族箱后，将水注入蓄池"],
["进人口","指收纳养子女而言"],
["安碓硙","安放舂米的石磨"],
["开生坟","开造坟墓"],
["合寿木","製作棺材"],
["教牛马","谓训练牛马之工作"],
["开柱眼","指作柱木之事"],
["造车器","造舟船；制造水陆交通工具(适新车交车)"],
["平治道涂","指铺平道路等工事"],
["整手足甲","初生婴儿第一次修剪手足甲"],
["造畜椆栖","是指建造家禽及家畜住的小屋"],
["取渔", "捕捞水中鱼虾"],
["结网","渔民织网"],
["会亲友","拜访亲友或设宴款待亲友"],
["造船","修造船只"],
["入学","拜师接受教育"],
];

// 类：封装黄历宜忌数据操作
// onReady : onload 事件处理函数
function YijiEventExplain(dataObjId, data_path, onReady) {
   
    /** 类的成员变量 **/
    this.dataPath = data_path;
    this.dataObjId = dataObjId;
    this.hlDB = null;
    this.onReady = onReady;
    // 通过创建 script 节点，加载 JS 文件数据
    this.loadDataFile = function (dataPath, dataObjId, onReady) {
        var htmlHead = document.getElementsByTagName("head")[0];
        var scriptElm = document.getElementById(dataObjId);

        if (htmlHead != null) {
            // 必须移除原节点，重新添加，否则JS 脚本不会重新加载
            if (scriptElm != null) {
                htmlHead.removeChild(scriptElm);
            }

            scriptElm = document.createElement("script");
            scriptElm.id = "scriptHangliData";
            scriptElm.src = dataPath;
            scriptElm.onload = onReady;
            htmlHead.appendChild(scriptElm);
        }
    }

    this.bindData = function (dataObjId) {
        if (typeof(dataObjId)=="string") {
            this.hlDB = eval(dataObjId);
        }
        else if (typeof(dataObjId)=="object") {
            this.hlDB = dataObjId;
        }
        return (this.hlDB);
    }

    // 查找宜/忌名称相同的记录，返回相应的解释
    this.getEventExplain = function (eventName) {
        var evnIdx = 0;
        var expIdx = 1;
        this.hlDB = this.bindData();

        if (this.hlDB != null){
            for(var i=0; i < this.hlDB.length; i++){
                if (this.hlDB[i][evnIdx] == eventName){
                    return this.hlDB[i][expIdx];
                }
            }
        } 

        return null;
    }
	
    // 模糊查找宜/忌名称相同的记录，返回相应的解释
	this.getEventRelExplain = function (eventName) {
        var evnIdx = 0;
        var expIdx = 1;
        this.hlDB = this.bindData();

        if (this.hlDB != null){
            for(var i=0; i < this.hlDB.length; i++){
				var evn = this.hlDB[i][evnIdx];
				var xpl = this.hlDB[i][expIdx];
				
                if (evn == eventName){
                    return xpl;
                }
				else if (evn.indexOf(eventName)>=0){
					return xpl;
				}
				else if (xpl.indexOf(eventName)>=0){
					return xpl;
				}
            }
        } 

        return null;
    }
   
    /** 类的初始化代码 **/
    if (data_path && dataObjId) {
        this.loadDataFile(this.dataPath, this.dataObjId, this.onReady);
    }
    else /* 如果未指定构造函的参数，则仅关联已加载的Yi Ji 数据 */
    {
        this.bindData(this.dataObjId);
    }
}