
function MM_goToURL() {
  var i, args=MM_goToURL.arguments; document.MM_returnValue = false;
  for (i=0; i<(args.length-1); i+=2) eval(args[i]+".location='"+args[i+1]+"'");
}
//host=location.hostname;
//if(host.indexOf("laohuangli")==-1)
//MM_goToURL('parent','http://www.laohuangli.net');


//省城市区县三级菜单数据
function Dsy()
{
this.Items = {};
}
Dsy.prototype.add = function(id,iArray)
{
this.Items[id] = iArray;
}
Dsy.prototype.Exists = function(id)
{
if(typeof(this.Items[id]) == "undefined") return false;
return true;
}

function change(v) {
    var str = "0";
    for (i = 0; i < v; i++) { str += ("_" + (document.getElementById(s[i]).selectedIndex - 1)); };
    var ss = document.getElementById(s[v]);
    with (ss) {
        length = 0;
        options[0] = new Option(opt0[v], opt0[v]);
        if (v && document.getElementById(s[v - 1]).selectedIndex > 0 || !v) {
            if (dsy.Exists(str)) {
                ar = dsy.Items[str];
                for (i = 0; i < ar.length; i++) options[length] = new Option(ar[i], ar[i]);
                if (v) options[1].selected = true;
            }
        }
        if (++v < s.length) { change(v); }
    }
}

var dsy = new Dsy();

dsy.add("0",["北京","上海","天津","重庆","广东","广西","贵州","海南","河北","河南","黑龙江","湖北","湖南","吉林","江苏","江西","辽宁","内蒙古","宁夏","青海","山东","山西","陕西","四川","西藏","新疆","云南","浙江","甘肃","安徽","福建"]);

dsy.add("0_0",["北京"]);
dsy.add("0_0_0",["东城区","西城区","宣武区","房山区","崇文区","海淀区","朝阳区","丰台区","门头沟区","石景山区","通州区","顺义区","昌平区","大兴区","怀柔区","平谷区","密云县","延庆县"]);

dsy.add("0_1",["上海"]);
dsy.add("0_1_0",["黄浦区","卢湾区","静安区","徐汇区","虹口区","长宁路","普陀区","闸北区","杨浦区","浦东新区","宝山区","嘉定区","闵行区","松江区","青浦区","南汇区","奉贤区","金山区","崇明县"]);

dsy.add("0_2",["天津"]);
dsy.add("0_2_0",["和平区","河东区","河西区","南开区","河北区","红桥区","塘沽区","汉沽区","大港区","东丽区","西青区","津南区","北辰区","武清区","宝坻区","宁河县","静海县","蓟县"]);

dsy.add("0_3",["重庆"]);
dsy.add("0_3_0",["渝中区","大渡口区","江北区","沙坪坝区","九龙坡区","南岸区","北碚区","万盛区","双桥区","渝北区","巴南区","万州区","涪陵区","黔江区","长寿区","江津区","合川区","永川区","永川区","南川区","綦江县","潼南县","铜梁县","大足县","荣昌县","璧山县","梁平县","城口县","丰都县","垫江县","武隆县","忠县","开县","云阳县","奉节县","巫山县","巫溪县","石柱土家族自治县","秀山土家族苗族自治县","酉阳土家族苗族自治县","彭水苗族土家族自治县"]);

//广东
dsy.add("0_4",["广州市","深圳市","珠海市","汕头市","韶关市","佛山市","江门市","湛江市","茂名市","肇庆市","惠州市","梅州市","汕尾市","河源市","阳江市","清远市","东莞市","中山市","潮州市","揭阳市","云浮市"]);
dsy.add("0_4_0",["越秀区","荔湾区","海珠区","天河区","白云区","黄埔区","番禺区","花都区","南沙区","萝岗区","增城市","从化市"]);
dsy.add("0_4_1",["福田区","罗湖区","南山区","宝安区","龙岗区","盐田区"]);
dsy.add("0_4_2",["香洲区","斗门区","金湾区"]);
dsy.add("0_4_3",["金平区","龙湖区","濠江区","潮阳区","潮南区","澄海区","南澳县"]);
dsy.add("0_4_4",["浈江区","武江区","曲江区","乐昌市","南雄市","始兴县","仁化县","翁源县","新丰县","乳源瑶族自治县"]);
dsy.add("0_4_5",["禅城区","南海区","顺德区","三水区","高明区"]);
dsy.add("0_4_6",["江海区","蓬江区","新会区","台山市","开平市","鹤山市","恩平市"]);
dsy.add("0_4_7",["赤坎区","霞山区","坡头区","麻章区","廉江市","雷州市","吴川市","遂溪县","徐闻县"]);
dsy.add("0_4_8",["茂南区","茂港区","高州市","化州市","信宜市","电白县"]);
dsy.add("0_4_9",["端州区","鼎湖区","高要市","四会市","广宁县","怀集县","封开县","德庆县"]);
dsy.add("0_4_10",["惠城区","惠阳区","博罗县","惠东县","龙门县"]);
dsy.add("0_4_11",["梅江区","兴宁市","梅县","大埔县","丰顺县","五华县","平远县","蕉岭县"]);
dsy.add("0_4_12",["汕尾市","陆丰市","海丰县","陆河县"]);
dsy.add("0_4_13",["源城区","紫金县","龙川县","连平县","和平县","东源县"]);
dsy.add("0_4_14",["江城区","阳春市","阳西县","阳东县"]);
dsy.add("0_4_15",["清城区","英德市","连州市","佛冈县","阳山县","清新县","连山壮族瑶族自治县","连南瑶族自治县"]);
dsy.add("0_4_16",["东莞市"]);
dsy.add("0_4_17",["中山市"]);
dsy.add("0_4_18",["湘桥区","潮安县","饶平县"]);
dsy.add("0_4_19",["榕城区","普宁市","揭东县","揭西县","惠来县"]);
dsy.add("0_4_20",["云城区","罗定市","新兴县","郁南县","云安县"]);

//广西
dsy.add("0_5",["南宁市","柳州市","桂林市","梧州市","北海市","防城港市","钦州市","贵港市","玉林市","百色市","贺州市","河池市","来宾市","崇左市"]);
dsy.add("0_5_0",["青秀区","兴宁区","西乡塘区","良庆区","江南区","邕宁区","武鸣县","隆安县","马山县","上林县","宾阳县","横县"]);
dsy.add("0_5_1",["城中区","鱼峰区","柳北区","柳南区","柳江县","柳城县","鹿寨县","融安县","融水苗族自治县","三江侗族自治县"]);
dsy.add("0_5_2",["象山区","秀峰区","叠彩区","七星区","雁山区","阳朔县","临桂县","灵川县","全州县","平乐县","兴安县","灌阳县","荔浦县","资源县","永福县","龙胜各族自治县","恭城瑶族自治县"]);
dsy.add("0_5_3",["万秀区","蝶山区","长洲区","岑溪市","苍梧县","藤县","蒙山县"]);
dsy.add("0_5_4",["海城区","银海区","铁山港区","合浦县"]);
dsy.add("0_5_5",["港口区","防城区","东兴市","上思县"]);
dsy.add("0_5_6",["钦南区","钦北区","灵山县","浦北县"]);
dsy.add("0_5_7",["港北区","港南区","覃塘区","桂平市","平南县"]);
dsy.add("0_5_8",["玉州区","北流市","容县","陆川县","博白县","兴业县"]);
dsy.add("0_5_9",["右江区","凌云县","平果县","西林县","乐业县","德保县","田林县","田阳县","靖西县","田东县","那坡县","隆林各族自治县"]);
dsy.add("0_5_10",["八步区","钟山县","昭平县","富川瑶族自治县"]);
dsy.add("0_5_11",["金城江区","宜州市","天峨县","凤山县","南丹县","东兰县","都安瑶族自治县","罗城仫佬族自治县","巴马瑶族自治县","环江毛南族自治县","大化瑶族自治县"]);
dsy.add("0_5_12",["兴宾区","合山市","象州县","武宣县","忻城县","金秀瑶族自治县"]);
dsy.add("0_5_13",["江州区","凭祥市","宁明县","扶绥县","龙州县","大新县","天等县"]);

//贵州
dsy.add("0_6",["贵阳市","六盘水市","遵义市","安顺市","铜仁地区","毕节地区","黔西南布依族苗族自治州","黔东南苗族侗族自治州","黔南布依族苗族自治州"]);
dsy.add("0_6_0",["乌当区","南明区","云岩区","花溪区","白云区","小河区","清镇市","开阳县","修文县","息烽县"]);
dsy.add("0_6_1",["钟山区","水城县","盘县","六枝特区"]);
dsy.add("0_6_2",["红花岗区","汇川区","赤水市","仁怀市","遵义县","绥阳县","桐梓县","习水县","凤冈县","正安县","余庆县","湄潭县","道真仡佬族苗族自治县","务川仡佬族苗族自治县"]);
dsy.add("0_6_3",["西秀区","普定县","平坝县","镇宁布依族苗族自治县","紫云苗族布依族自治县","关岭布依族苗族自治县"]);
dsy.add("0_6_4",["铜仁市","德江县","江口县","思南县","石阡县","玉屏侗族自治县","松桃苗族自治县","印江土家族苗族自治县","沿河土家族自治县","万山特区"]);
dsy.add("0_6_5",["毕节市","黔西县","大方县","织金县","金沙县","赫章县","纳雍县","威宁彝族回族苗族自治县"]);
dsy.add("0_6_6",["兴义市","望谟县","兴仁县","普安县","册亨县","晴隆县","贞丰县","安龙县"]);
dsy.add("0_6_7",["凯里市","施秉县","从江县","锦屏县","镇远县","麻江县","台江县","天柱县","黄平县","榕江县","剑河县","三穗县","雷山县","黎平县","岑巩县","丹寨县"]);
dsy.add("0_6_8",["都匀市","福泉市","贵定县","惠水县","罗甸县","瓮安县","荔波县","龙里县","平塘县","长顺县","独山县","三都水族自治县"]);

//海南
dsy.add("0_7",["海口市","三亚市","省直属"]);
dsy.add("0_7_0",["龙华区","秀英区","琼山区","美兰区"]);
dsy.add("0_7_1",["三亚市"]);
dsy.add("0_7_2",["五指山市","琼海市","儋州市","文昌市","万宁市","东方市","定安县","屯昌县","澄迈县","临高县","西南中沙群岛办事处","白沙黎族自治县","昌江黎族自治县","乐东黎族自治县","陵水黎族自治县","保亭黎族苗族自治县","琼中黎族苗族自治县"]);

//河北
dsy.add("0_8",["石家庄市","唐山市","秦皇岛市","邯郸市","邢台市","保定市","张家口市","承德市","沧州市","廊坊市","衡水市"]);
dsy.add("0_8_0",["长安区","桥东区","桥西区","新华区","井陉矿区","裕华区","辛集市","藁城市","晋州市","新乐市","鹿泉市","井陉县","正定县","栾城县","行唐县","灵寿县","高邑县","深泽县","赞皇县","无极县","平山县","元氏县","赵县"]);
dsy.add("0_8_1",["路北区","路南区","古冶区","开平区","丰南区","丰润区","遵化市","迁安市","滦县","滦南县","乐亭县","迁西县","玉田县","唐海县"]);
dsy.add("0_8_2",["海港区","山海关区","北戴河区","昌黎县","抚宁县","卢龙县","青龙满族自治县"]);
dsy.add("0_8_3",["丛台区","邯山区","复兴区","峰峰矿区","武安市","邯郸县","临漳县","成安县","大名县","涉县","磁县","肥乡县","永年县","邱县","鸡泽县","广平县","馆陶县","魏县","曲周县"]);
dsy.add("0_8_4",["桥东区","桥西区","南宫市","沙河市","邢台县","临城县","内丘县","柏乡县","隆尧县","任县","南和县","宁晋县","巨鹿县","新河县","广宗县","平乡县","威县","清河县","临西县"]);
dsy.add("0_8_5",["新市区","北市区","南市区","涿州市","定州市","安国市","高碑店市","满城县","清苑县","涞水县","阜平县","徐水县","定兴县","唐县","高阳县","容城县","涞源县","望都县","安新县","易县","曲阳县","蠡县","顺平县","博野县","雄县"]);
dsy.add("0_8_6",["桥西区","桥东区","宣化区","下花园区","宣化县","张北县","康保县","沽源县","尚义县","蔚县","阳原县","怀安县","万全县","怀来县","涿鹿县","赤城县","崇礼县"]);
dsy.add("0_8_7",["双桥区","双滦区","鹰手营子矿区","承德县","兴隆县","平泉县","滦平县","隆化县","丰宁满族自治县","宽城满族自治县","围场满族蒙古族自治县"]);
dsy.add("0_8_8",["运河区","新华区","泊头市","任丘市","黄骅市","河间市","沧县","青县","东光县","海兴县","盐山县","肃宁县","南皮县","吴桥县","献县","孟村回族自治县"]);
dsy.add("0_8_9",["安次区","广阳区","霸州市","三河市","固安县","永清县","香河县","大城县","文安县","大厂回族自治县"]);
dsy.add("0_8_10",["桃城区","冀州市","深州市","枣强县","武邑县","武强县","饶阳县","安平县","故城县","景县","阜城县"]);

//河南
dsy.add("0_9",["郑州市","开封市","洛阳市","平顶山市","焦作市","鹤壁市","新乡市","安阳市","濮阳市","许昌市","漯河市","三门峡市","南阳市","商丘市","信阳市","周口市","驻马店市","济源市"]);
dsy.add("0_9_0",["中原区","二七区","管城区","金水区","上街区","惠济区","巩义市","荥阳市","新密市","新郑市","登封市","中牟县"]);
dsy.add("0_9_1",["鼓楼区","龙亭区","顺河区","禹王台","金明区","杞县","通许县","尉氏县","开封县","兰考县"]);
dsy.add("0_9_2",["西工区","老城区","瀍河区","涧西区","吉利区","洛龙区","偃师市","孟津县","新安县","栾川县","嵩县","汝阳县","宜阳县","洛宁县","伊川县"]);
dsy.add("0_9_3",["新华区","卫东区","湛河区","石龙区","舞钢市","汝州市","宝丰县","叶县","鲁山县","郏县"]);
dsy.add("0_9_4",["山阳区","解放区","中站区","马村区","沁阳市","孟州市","修武县","博爱县","武陟县","温县"]);
dsy.add("0_9_5",["淇滨区","山城区","鹤山区","浚县","淇县"]);
dsy.add("0_9_6",["卫滨区","红旗区","凤泉区","牧野区","卫辉市","辉县市","新乡县","获嘉县","原阳县","延津县","封丘县","长垣县"]);
dsy.add("0_9_7",["北关区","文峰区","殷都区","龙安区","林州市","安阳县","汤阴县","滑县","内黄县"]);
dsy.add("0_9_8",["华龙区","清丰县","南乐县","范县","台前县","濮阳县"]);
dsy.add("0_9_9",["魏都区","禹州市","长葛市","许昌县","鄢陵县","襄城县"]);
dsy.add("0_9_10",["源汇区","郾城区","召陵区","舞阳县","临颍县"]);
dsy.add("0_9_11",["湖滨区","义马市","灵宝市","渑池县","陕县","卢氏县"]);
dsy.add("0_9_12",["卧龙区","宛城区","邓州市","南召县","方城县","西峡县","镇平县","内乡县","淅川县","社旗县","唐河县","新野县","桐柏县"]);
dsy.add("0_9_13",["梁园区","睢阳区","永城市","民权县","睢县","宁陵县","柘城县","虞城县","夏邑县"]);
dsy.add("0_9_14",["浉河区","平桥区","罗山县","光山县","新县","商城县","固始县","潢川县","淮滨县","息县"]);
dsy.add("0_9_15",["川汇区","项城市","扶沟县","西华县","商水县","沈丘县","郸城县","淮阳县","太康县","鹿邑县"]);
dsy.add("0_9_16",["驿城区","西平县","上蔡县","平舆县","正阳县","确山县","泌阳县","汝南县","遂平县","新蔡县"]);
dsy.add("0_9_17",["济源市"]);

//黑龙江
dsy.add("0_10",["哈尔滨市","齐齐哈尔市","鸡西市","鹤岗市","双鸭山市","大庆市","伊春市","佳木斯市","七台河市","牡丹江市","黑河市","绥化市","大兴安岭地区"]);
dsy.add("0_10_0",["松北区","道里区","南岗区","道外区","平房区","香坊区","呼兰区","阿城区","双城市","尚志市","五常市","依兰县","方正县","宾县","巴彦县","木兰县","通河县","延寿县"]);
dsy.add("0_10_1",["龙沙区","建华区","铁锋区","昂昂溪区","富拉尔基区","碾子山区","梅里斯区","讷河市","龙江县","依安县","泰来县","甘南县","富裕县","克山县","克东县","拜泉县"]);
dsy.add("0_10_2",["鸡冠区","恒山区","滴道区","梨树区","城子河区","麻山区","虎林市","密山市","鸡东县"]);
dsy.add("0_10_3",["兴山区","向阳区","工农区","南山区","兴安区","东山区","萝北县","绥滨县"]);　　　
dsy.add("0_10_4",["尖山区","岭东区","四方台区","宝山区","集贤县","友谊县","宝清县","饶河县"]);
dsy.add("0_10_5",["萨尔图区","龙凤区","让胡路区","红岗区","大同区","肇州县","肇源县","林甸县","杜尔伯特蒙古族自治县"]);
dsy.add("0_10_6",["伊春区","南岔","友好","西林区","翠峦区","新青区","美溪区","金山屯","五营","乌马河","汤旺河","带岭区","乌伊岭","红星区","上甘岭","铁力市","嘉荫县"]);
dsy.add("0_10_7",["前进区","向阳区","东风区","郊区","同江市","富锦市","桦南县","桦川县","汤原县","抚远县"]);
dsy.add("0_10_8",["桃山区","新兴区","茄子河区","勃利县"]);
dsy.add("0_10_9",["爱民区","东安区","阳明区","西安区","绥芬河市","海林市","宁安市","穆棱市","东宁县","林口县"]);
dsy.add("0_10_10",["爱辉区","北安市","五大连池市","嫩江县","逊克县","孙吴县"]);
dsy.add("0_10_11",["北林区","安达市","肇东市","海伦市","望奎县","兰西县","青冈县","庆安县","明水县","绥棱县"]);
dsy.add("0_10_12",["呼玛县","塔河县","漠河县","加格达奇区","松岭区","新林区","呼中区"]);


//湖北
dsy.add("0_11",["武汉市","黄石市","襄樊市","十堰市","荆州市","宜昌市","荆门市","鄂州市","孝感市","黄冈市","咸宁市","随州市","恩施州","省直辖"]);
dsy.add("0_11_0",["江岸","江汉","硚口","汉阳","武昌","青山","洪山","东西湖","汉南","蔡甸","江夏","黄陂","新洲"]); 
dsy.add("0_11_1",["黄石港","西塞山","下陆","铁山","大冶","阳新"]);
dsy.add("0_11_2",["襄城","樊城","襄阳","老河口","枣阳","宜城","南漳","谷城","保康"]);
dsy.add("0_11_3",["茅箭","张湾","丹江口","郧县","郧西","竹山","竹溪","房县"]);
dsy.add("0_11_4",["沙市","荆州","石首","洪湖","松滋","公安","监利","江陵"]);
dsy.add("0_11_5",["西陵","伍家岗","点军","猇亭","夷陵","宜都","当阳","枝江","远安","兴山","秭归","长阳","五峰"]);
dsy.add("0_11_6",["东宝","掇刀","钟祥","京山","沙洋"]);
dsy.add("0_11_7",["鄂城","梁子湖","华容"]);
dsy.add("0_11_8",["孝南","应城","安陆","汉川","孝昌","大悟","云梦"]);
dsy.add("0_11_9",["黄州","麻城","武穴","团风","红安","罗田","英山","浠水","蕲春","黄梅"]);
dsy.add("0_11_10",["咸安","赤壁","嘉鱼","通城","崇阳","通山"]);
dsy.add("0_11_11",["曾都","广水"]);
dsy.add("0_11_12",["恩施","利川","建始","巴东","宣恩","咸丰","来凤","鹤峰"]);
dsy.add("0_11_13",["仙桃","潜江","天门","神农架"]);

//湖南
dsy.add("0_12",["长沙市","株洲市","湘潭市","衡阳市","邵阳市","岳阳市","常德市","张家界市","益阳市","郴州市","永州市","怀化市","娄底市","湘西州"]);
dsy.add("0_12_0",["芙蓉区","天心区","岳麓区","开福区","雨花区","浏阳市","长沙县","望城县","宁乡县"]); 
dsy.add("0_12_1",["荷塘区","芦淞区","石峰区","天元区","醴陵市","株洲县","攸县","茶陵县","炎陵县"]);
dsy.add("0_12_2",["雨湖区","岳塘区","湘乡市","韶山市","湘潭县"]);
dsy.add("0_12_3",["珠晖区","雁峰区","石鼓区","蒸湘区","南岳区","耒阳市","常宁市","衡阳县","衡南县","衡山县","衡东县","祁东县"]);
dsy.add("0_12_4",["双清区","大祥区","北塔区","武冈市","邵东县","新邵县","邵阳县","隆回县","洞口县","绥宁县","新宁县","城步自治县"]);
dsy.add("0_12_5",["岳阳楼","云溪区","君山区","汨罗市","临湘市","岳阳县","华容县","湘阴县","平江县"]);
dsy.add("0_12_6",["武陵区","鼎城区","津市市","安乡县","汉寿县","澧县","临澧县","桃源县","石门县"]);
dsy.add("0_12_7",["永定区","武陵源","慈利县","桑植县"]);
dsy.add("0_12_8",["资阳区","赫山区","沅江市","南县","桃江县","安化县"]);
dsy.add("0_12_9",["北湖区","苏仙区","资兴市","桂阳县","宜章县","永兴县","嘉禾县","临武县","汝城县","桂东县","安仁县"]);
dsy.add("0_12_10",["零陵区","冷水滩","祁阳县","东安县","双牌县","道县","江永县","宁远县","蓝山县","新田县","江华自治县"]);
dsy.add("0_12_11",["鹤城区","洪江市","沅陵县","辰溪县","溆浦县","中方县","会同县","麻阳自治县","新晃自治县","芷江自治县","靖州自治县","通道自治县"]);
dsy.add("0_12_12",["娄星区","冷水江","涟源市","双峰县","新化县"]);
dsy.add("0_12_13",["吉首市","泸溪县","凤凰县","花垣县","保靖县","古丈县","永顺县","龙山县"]);

//吉林
dsy.add("0_13",["长春市","吉林市","四平市","辽源市","通化市","白山市","松原市","白城市","延边朝鲜族自治州"]);
dsy.add("0_13_0",["朝阳区","南关区","宽城区","二道区","绿园区","双阳区","德惠市","九台市","榆树市","农安县"]); 
dsy.add("0_13_1",["船营区","昌邑区","龙潭区","丰满区","蛟河市","桦甸市","舒兰市","磐石市","永吉县"]);
dsy.add("0_13_2",["铁西区","铁东区","公主岭市","双辽市","梨树县","伊通满族自治县"]);
dsy.add("0_13_3",["龙山区","西安区","东丰县","东辽县"]);
dsy.add("0_13_4",["东昌区","二道江区","梅河口市","集安市","通化县","辉南县","柳河县"]);
dsy.add("0_13_5",["八道江区","江源区","临江市","抚松县","靖宇县","长白朝鲜族自治县"]);
dsy.add("0_13_6",["宁江区","长岭县","乾安县","扶余县","前郭尔罗斯蒙古族自治县"]);
dsy.add("0_13_7",["洮北区","洮南市","大安市","镇赉县","通榆县"]);
dsy.add("0_13_8",["延吉市","图们市","敦化市","珲春市","龙井市","和龙市","汪清县","安图县"]);

//江苏
dsy.add("0_14",["南京市","无锡市","徐州市","常州市","苏州市","南通市","连云港","淮安市","盐城市","扬州市","镇江市","泰州市","宿迁市"]);
dsy.add("0_14_0",["玄武","白下","秦淮","建邺","鼓楼","下关","浦口","栖霞","雨花台","江宁","六合","溧水","高淳"]); 
dsy.add("0_14_1",["崇安","南长","北塘","滨湖","锡山","惠山","江阴","宜兴"]);
dsy.add("0_14_2",["云龙","鼓楼","九里","贾汪","泉山","新沂","邳州","丰县","沛县","铜山","睢宁"]);
dsy.add("0_14_3",["钟楼","天宁","戚墅堰","新北","武进","溧阳","金坛"]);
dsy.add("0_14_4",["金阊","沧浪","平江","虎丘","吴中","相城","常熟","张家港","昆山","吴江","太仓"]);
dsy.add("0_14_5",["崇川","港闸","启东","如皋","通州","海门","海安","如东"]);
dsy.add("0_14_6",["新浦","连云","海州","赣榆","东海","灌云","灌南"]);
dsy.add("0_14_7",["清河","清浦","楚州","淮阴","涟水","洪泽","盱眙","金湖"]);
dsy.add("0_14_8",["亭湖","盐都","东台","大丰","响水","滨海","阜宁","射阳","建湖"]);
dsy.add("0_14_9",["广陵","邗江","维扬区","仪征","高邮","江都","宝应"]);
dsy.add("0_14_10",["京口","润州","丹徒","丹阳","扬中","句容"]);
dsy.add("0_14_11",["海陵","高港","兴化","靖江","泰兴","姜堰"]);
dsy.add("0_14_12",["宿城","宿豫","沭阳","泗阳","泗洪"]);

//江西
dsy.add("0_15",["南昌市","景德镇市","萍乡市","九江市","新余市","鹰潭市","赣州市","吉安市","宜春市","抚州市","上饶市"]);
dsy.add("0_15_0",["东湖区","西湖区","青云谱","湾里区","青山湖","南昌县","新建县","安义县","进贤县"]); 
dsy.add("0_15_1",["珠山区","昌江区","乐平市","浮梁县"]);
dsy.add("0_15_2",["安源区","湘东区","莲花县","芦溪县","上栗县"]);
dsy.add("0_15_3",["浔阳区","庐山区","瑞昌市","九江县","武宁县","修水县","永修县","德安县","星子县","都昌县","湖口县","彭泽县"]);
dsy.add("0_15_4",["渝水区","分宜县"]);
dsy.add("0_15_5",["月湖区","贵溪市","余江县"]);
dsy.add("0_15_6",["章贡区","瑞金市","南康市","赣县","信丰县","大余县","上犹县","崇义县","安远县","龙南县","定南县","全南县","宁都县","于都县","兴国县","会昌县","寻乌县","石城县"]);
dsy.add("0_15_7",["吉州区","青原区","井冈山","吉安县","吉水县","峡江县","新干县","永丰县","泰和县","遂川县","万安县","安福县","永新县"]);
dsy.add("0_15_8",["袁州区","丰城市","樟树市","高安市","奉新县","万载县","上高县","宜丰县","靖安县","铜鼓县"]);
dsy.add("0_15_9",["临川区","南城县","黎川县","南丰县","崇仁县","乐安县","宜黄县","金溪县","资溪县","东乡县","广昌县"]);
dsy.add("0_15_10",["信州区","德兴市","上饶县","广丰县","玉山县","铅山县","横峰县","弋阳县","余干县","鄱阳县","万年县","婺源县"]);

//辽宁
dsy.add("0_16",["沈阳市","大连市","鞍山市","抚顺市","本溪市","丹东市","锦州市","营口市","阜新市","辽阳市","盘锦市","铁岭市","朝阳市","葫芦岛市"]);
dsy.add("0_16_0",["沈河区","和平区","大东区","皇姑区","铁西区","苏家屯区","东陵区","沈北新区","于洪区","新民市","辽中县","康平县","法库县"]); 
dsy.add("0_16_1",["西岗区","中山区","沙河口区","甘井子区","旅顺口区","金州区","瓦房店市","普兰店市","庄河市","长海县"]);
dsy.add("0_16_2",["铁东区","铁西区","立山区","千山区","海城市","台安县","岫岩满族自治县"]);
dsy.add("0_16_3",["顺城区","新抚区","东洲区","望花区","抚顺县","新宾满族自治县","清原满族自治县"]);
dsy.add("0_16_4",["平山区","溪湖区","明山区","南芬区","本溪满族自治县","桓仁满族自治县"]);
dsy.add("0_16_5",["振兴区","元宝区","振安区","东港市","凤城市","宽甸满族自治县"]);
dsy.add("0_16_6",["太和区","古塔区","凌河区","凌海市","北镇市","黑山县","义县"]);
dsy.add("0_16_7",["站前区","西市区","鲅鱼圈区","老边区","盖州市","大石桥市"]);
dsy.add("0_16_8",["海州区","新邱区","太平区","清河门区","细河区","阜新蒙古族自治县","彰武县"]);
dsy.add("0_16_9",["白塔区","文圣区","宏伟区","弓长岭区","太子河区","灯塔市","辽阳县"]);
dsy.add("0_16_10",["兴隆台区","双台子区","大洼县","盘山县"]);
dsy.add("0_16_11",["银州区","清河区","调兵山市","开原市","铁岭县","西丰县","昌图县"]);
dsy.add("0_16_12",["双塔区","龙城区","北票市","凌源市","朝阳县","建平县","喀喇沁左翼蒙古族自治县"]);
dsy.add("0_16_13",["龙港区","连山区","南票区","兴城市","绥中县","建昌县"]);

//内蒙古
dsy.add("0_17",["呼和浩特市","包头市","乌海市","赤峰市","通辽市","鄂尔多斯市","呼伦贝尔市","巴彦淖尔市","乌兰察布市","兴安盟","锡林郭勒盟","阿拉善盟"]);
dsy.add("0_17_0",["回民区","新城区","玉泉区","赛罕区","土默特左旗","托克托县","和林格尔县","清水河县","武川县"]); 
dsy.add("0_17_1",["昆都仑区","东河区","青山区","石拐区","白云矿区","九原区","土默特右旗","固阳县","达尔罕茂明安联合旗"]);
dsy.add("0_17_2",["海勃湾区","海南区","乌达区"]);
dsy.add("0_17_3",["红山区","元宝山区","松山区","阿鲁科尔沁旗","巴林左旗","巴林右旗","林西县","克什克腾旗","翁牛特旗","喀喇沁旗","宁城县","敖汉旗"]);
dsy.add("0_17_4",["科尔沁区","霍林郭勒市","科尔沁左翼中旗","科尔沁左翼后旗","开鲁县","库伦旗","奈曼旗","扎鲁特旗"]);
dsy.add("0_17_5",["东胜区","达拉特旗","准格尔旗","鄂托克前旗","鄂托克旗","杭锦旗","乌审旗","伊金霍洛旗"]);
dsy.add("0_17_6",["海拉尔","满洲里","牙克石","扎兰屯","额尔古纳","根河","阿荣旗","鄂伦春自治旗","鄂温克族自治旗","陈巴尔虎旗","新巴尔虎左旗","新巴尔虎右旗"]);
dsy.add("0_17_7",["临河区","五原县","磴口县","乌拉特前旗","乌拉特中旗","乌拉特后旗","杭锦后旗"]);
dsy.add("0_17_8",["集宁区","丰镇市","卓资县","化德县","商都县","兴和县","凉城县","察哈尔右翼前旗","察哈尔右翼中旗","察哈尔右翼后旗","四子王旗"]);
dsy.add("0_17_9",["乌兰浩特市","阿尔山市","科尔沁右翼前旗","科尔沁右翼中旗","扎赉特旗","突泉县"]);
dsy.add("0_17_10",["二连浩特","锡林浩特","阿巴嘎旗","苏尼特左旗","苏尼特右旗","东乌珠穆沁旗","西乌珠穆沁旗","太仆寺旗","镶黄旗","正镶白旗","正蓝旗","多伦"]);
dsy.add("0_17_11",["阿拉善左旗","阿拉善右旗","额济纳旗"]);

//宁夏
dsy.add("0_18",["银川市","石嘴山市","吴忠市","固原市","中卫市"]);
dsy.add("0_18_0",["兴庆区","金凤区","西夏区","永宁县","贺兰县","灵武市"]); 
dsy.add("0_18_1",["大武口区","惠农区","平罗县"]);
dsy.add("0_18_2",["利通区","盐池县","同心县","青铜峡市"]);
dsy.add("0_18_3",["原州区","西吉县","隆德县","泾源县","彭阳县"]);
dsy.add("0_18_4",["沙坡头区","中宁县","海原县"]);

//青海
dsy.add("0_19",["西宁市","海东地区","海北藏族自治州","黄南藏族自治州","海南藏族自治州","果洛藏族自治州","玉树藏族自治州","海西蒙古族藏族自治州"]);
dsy.add("0_19_0",["城东区","城中区","城西区","城北区","湟中县","湟源县","大通回族土族自治县"]); 
dsy.add("0_19_1",["平安县","乐都县","民和回族土族自治县","互助土族自治县","化隆回族自治县","循化撒拉族自治县"]);
dsy.add("0_19_2",["海晏县","祁连县","刚察县","门源回族自治县"]);
dsy.add("0_19_3",["同仁县","尖扎县","泽库县","河南蒙古族自治县"]);
dsy.add("0_19_4",["共和县","同德县","贵德县","兴海县","贵南县"]);
dsy.add("0_19_5",["玛沁县","班玛县","甘德县","达日县","久治县","玛多县"]);
dsy.add("0_19_6",["玉树县","杂多县","称多县","治多县","囊谦县","曲麻莱县"]);
dsy.add("0_19_7",["德令哈市","格尔木市","乌兰县","都兰县","天峻县","冷湖行委","大柴旦行委","茫崖行委"]);

//山东
dsy.add("0_20",["济南市","青岛市","淄博市","枣庄市","东营市","烟台市","潍坊市","威海市","济宁市","泰安市","日照市","莱芜市","临沂市","德州市","聊城市","滨州市","菏泽市"]);
dsy.add("0_20_0",["历下区","市中区","槐荫区","天桥区","历城区","长清区","章丘市","平阴县","济阳县","商河县"]); 
dsy.add("0_20_1",["市南区","市北区","四方区","黄岛区","崂山区","李沧区","城阳区","胶州市","即墨市","平度市","胶南市","莱西市"]);
dsy.add("0_20_2",["张店区","淄川区","博山区","临淄区","周村区","桓台县","高青县","沂源县"]);
dsy.add("0_20_3",["市中区","薛城区","峄城区","台儿庄区","山亭区","滕州市"]);
dsy.add("0_20_4",["东营区","河口区","垦利县","利津县","广饶县"]);
dsy.add("0_20_5",["芝罘区","福山区","牟平区","莱山区","龙口市","莱阳市","莱州市","蓬莱市","招远市","栖霞市","海阳市","长岛县"]);
dsy.add("0_20_6",["潍城区","寒亭区","坊子区","奎文区","青州市","诸城市","寿光市","安丘市","高密市","昌邑市","临朐县","昌乐县"]);
dsy.add("0_20_7",["环翠区","文登市","荣成市","乳山市"]);
dsy.add("0_20_8",["市中区","任城区","曲阜市","兖州市","邹城市","微山县","鱼台县","金乡县","嘉祥县","汶上县","泗水县","梁山县"]);
dsy.add("0_20_9",["泰山区","岱岳区","新泰市","肥城市","宁阳县","东平县"]);
dsy.add("0_20_10",["东港区","岚山区","五莲县","莒县"]);
dsy.add("0_20_11",["莱城区","钢城区"]);
dsy.add("0_20_12",["兰山区","罗庄区","河东区","沂南县","郯城县","沂水县","苍山县","费县","平邑县","莒南县","蒙阴县","临沭县"]);
dsy.add("0_20_13",["德城区","乐陵市","禹城市","陵县","宁津县","庆云县","临邑县","齐河县","平原县","夏津县","武城县"]);
dsy.add("0_20_14",["东昌府区","临清市","阳谷县","莘县","茌平县","东阿县","冠县","高唐县"]);
dsy.add("0_20_15",["滨城区","惠民县","阳信县","无棣县","沾化县","博兴县","邹平县"]);
dsy.add("0_20_16",["牡丹区","曹县","单县","成武县","巨野县","郓城县","鄄城县","定陶县","东明县"]);

//山西
dsy.add("0_21",["太原市","大同市","阳泉市","长治市","晋城市","朔州市","晋中市","运城市","忻州市","临汾市","吕梁市"]);
dsy.add("0_21_0",["小店区","迎泽区","杏花岭区","尖草坪区","万柏林区","晋源区","清徐县","阳曲县","娄烦县","古交市"]); 
dsy.add("0_21_1",["大同市城区","大同市矿区","南郊区","新荣区","阳高县","天镇县","广灵县","灵丘县","浑源县","左云县","大同县"]);
dsy.add("0_21_2",["阳泉市城区","阳泉市矿区","阳泉市郊区","平定县","盂县"]);
dsy.add("0_21_3",["长治市城区","长治市郊区","长治县","襄垣县","屯留县","平顺县","黎城县","壶关县","长子县","武乡县","沁县","沁源县","潞城市"]);
dsy.add("0_21_4",["晋城市城区","沁水县","阳城县","陵川县","泽州县","高平市"]);
dsy.add("0_21_5",["朔城区","平鲁区","山阴县","应县","右玉县","怀仁县"]);
dsy.add("0_21_6",["榆次区","榆社县","左权县","和顺县","昔阳县","寿阳县","太谷县","祁县","平遥县","灵石县","介休市"]);
dsy.add("0_21_7",["盐湖区","临猗县","万荣县","闻喜县","稷山县","新绛县","绛县","垣曲县","夏县","平陆县","芮城县","永济市","河津市"]);
dsy.add("0_21_8",["忻府区","定襄县","五台县","代县","繁峙县","宁武县","静乐县","神池县","五寨县","岢岚县","河曲县","保德县","偏关县","原平市"]);
dsy.add("0_21_9",["尧都区","曲沃县","翼城县","襄汾县","洪洞县","古县","安泽县","浮山县","吉县","乡宁县","大宁县","隰县","永和县","蒲县","汾西县","侯马市","霍州市"]);
dsy.add("0_21_10",["离石区","文水县","交城县","兴县","临县","柳林县","石楼县","岚县","方山县","中阳县","交口县","孝义市","汾阳市"]);

//陕西
dsy.add("0_22",["西安市","铜川市","宝鸡市","咸阳市","渭南市","延安市","汉中市","榆林市","安康市","商洛市"]);
dsy.add("0_22_0",["未央区","新城区","碑林区","莲湖区","灞桥区","雁塔区","阎良区","临潼区","长安区","蓝田县","周至县","户县","高陵县"]); 
dsy.add("0_22_1",["耀州区","王益区","印台区","宜君县"]);
dsy.add("0_22_2",["渭滨区","金台区","陈仓区","凤翔县","岐山县","扶风县","眉县","陇县","千阳县","麟游县","凤县","太白县"]);
dsy.add("0_22_3",["秦都区","杨陵区","渭城区","兴平市","三原县","泾阳县","乾县","礼泉县","永寿县","彬县","长武县","旬邑县","淳化县","武功县"]);
dsy.add("0_22_4",["临渭区","韩城市","华阴市","华县","潼关县","大荔县","合阳县","澄城县","蒲城县","白水县","富平县"]);
dsy.add("0_22_5",["宝塔区","延长县","延川县","子长县","安塞县","志丹县","吴起县","甘泉县","富县","洛川县","宜川县","黄龙县","黄陵县"]);
dsy.add("0_22_6",["汉台区","南郑县","城固县","洋县","西乡县","勉县","宁强县","略阳县","镇巴县","留坝县","佛坪县"]);
dsy.add("0_22_7",["榆阳区","神木县","府谷县","横山县","靖边县","定边县","绥德县","米脂县","佳县","吴堡县","清涧县","子洲县"]);
dsy.add("0_22_8",["汉滨区","汉阴县","石泉县","宁陕县","紫阳县","岚皋县","平利县","镇坪县","旬阳县","白河县"]);
dsy.add("0_22_9",["商州区","洛南县","丹凤县","商南县","山阳县","镇安县","柞水县"]);

//四川
dsy.add("0_23",["成都市","自贡市","攀枝花市","泸州市","德阳市","绵阳市","广元市","遂宁市","内江市","乐山市","南充市","宜宾市","广安市","达州市","眉山市","雅安市","巴中市","资阳市","阿坝州","甘孜州","凉山州"]);
dsy.add("0_23_0",["锦江","青羊","金牛","武侯","成华","龙泉驿","青白江","新都","温江区","都江堰","彭州","邛崃","崇州市","金堂","双流","郫县","大邑","蒲江","新津县"]); 
dsy.add("0_23_1",["自流井","贡井区","大安区","沿滩区","荣县","富顺县"]);
dsy.add("0_23_2",["攀枝花市东区","攀枝花市西区","仁和区","米易县","盐边县"]);
dsy.add("0_23_3",["江阳区","纳溪区","龙马潭","泸县","合江县","叙永县","古蔺县"]);
dsy.add("0_23_4",["旌阳区","广汉市","什邡市","绵竹市","罗江县","中江县"]);
dsy.add("0_23_5",["涪城区","游仙区","江油市","三台县","盐亭县","安县","梓潼县","平武县","北川羌族自治县"]);
dsy.add("0_23_6",["利州区","元坝区","朝天区","旺苍县","青川县","剑阁县","苍溪县"]);
dsy.add("0_23_7",["船山区","安居区","蓬溪县","射洪县","大英县"]);
dsy.add("0_23_8",["内江市中区","东兴区","威远县","资中县","隆昌县"]);
dsy.add("0_23_9",["乐山市中区","沙湾区","五通桥","金口河","峨眉山","犍为县","井研县","夹江县","沐川县","峨边彝族自治县","马边彝族自治县"]);
dsy.add("0_23_10",["顺庆区","高坪区","嘉陵区","阆中市","南部县","营山县","蓬安县","仪陇县","西充县"]);
dsy.add("0_23_11",["翠屏区","宜宾县","南溪县","江安县","长宁县","高县","珙县","筠连县","兴文县","屏山县"]);
dsy.add("0_23_12",["广安区","华蓥市","岳池县","武胜县","邻水县"]);
dsy.add("0_23_13",["通川区","万源市","达县","宣汉县","开江县","大竹县","渠县"]);
dsy.add("0_23_14",["东坡区","仁寿县","彭山县","洪雅县","丹棱县","青神县"]);
dsy.add("0_23_15",["雨城区","名山县","荥经县","汉源县","石棉县","天全县","芦山县","宝兴县"]);
dsy.add("0_23_16",["巴州区","通江县","南江县","平昌县"]);
dsy.add("0_23_17",["雁江区","简阳市","安岳县","乐至县"]);
dsy.add("0_23_18",["马尔康","汶川县","理县","茂县","松潘县","九寨沟县","金川县","小金县","黑水县","壤塘县","阿坝县","若尔盖县","红原县"]);
dsy.add("0_23_19",["康定县","泸定县","丹巴","九龙","雅江","道孚","炉霍","甘孜","新龙","德格","白玉","石渠","色达","理塘","巴塘","乡城","稻城","得荣"]);
dsy.add("0_23_20",["西昌市","盐源县","德昌县","会理县","会东","宁南","普格","布拖","金阳","昭觉","喜德","冕宁","越西","甘洛","美姑","雷波","木里自治县"]);

//西藏
dsy.add("0_24",["拉萨市","昌都地区","山南地区","日喀则地区","那曲地区","阿里地区","林芝地区"]);
dsy.add("0_24_0",["城关区","林周县","当雄县","尼木县","曲水县","堆龙德庆县","达孜县","墨竹工卡县"]); 
dsy.add("0_24_1",["昌都县","江达县","贡觉县","类乌齐县","丁青县","察雅县","八宿县","左贡县","芒康县","洛隆县","边坝县"]);
dsy.add("0_24_2",["乃东县","扎囊县","贡嘎县","桑日县","琼结县","曲松县","措美县","洛扎县","加查县","隆子县","错那县","浪卡子县"]);
dsy.add("0_24_3",["日喀则市","南木林县","江孜县","定日县","萨迦县","拉孜县","昂仁县","谢通门县","白朗县","仁布县","康马县","定结县","仲巴县","亚东县","吉隆县","聂拉木县","萨嘎县","岗巴县"]);
dsy.add("0_24_4",["那曲县","嘉黎县","比如县","聂荣县","安多县","申扎县","索县","班戈县","巴青县","尼玛县","双湖特别区"]);
dsy.add("0_24_5",["噶尔县","普兰县","札达县","日土县","革吉县","改则县","措勤县"]);
dsy.add("0_24_6",["林芝县","工布江达县","米林县","墨脱县","波密县","察隅县","朗县"]);

//新疆
dsy.add("0_25",["乌鲁木齐市","克拉玛依市","吐鲁番地区","哈密地区","和田地区","阿克苏地区","喀什地区","克孜勒苏柯尔克孜自治州","巴音郭楞蒙古自治州","昌吉回族自治州","博尔塔拉蒙古自治州","伊犁哈萨克自治州","塔城地区","阿勒泰地区","直辖行政地区"]);
dsy.add("0_25_0",["天山区","沙依巴克区","新市区","水磨沟区","头屯河区","达坂城区","米东区","乌鲁木齐县"]); 
dsy.add("0_25_1",["克拉玛依区","独山子区","白碱滩区","乌尔禾区"]);
dsy.add("0_25_2",["吐鲁番市","鄯善县","托克逊县"]);
dsy.add("0_25_3",["哈密市","伊吾县","巴里坤哈萨克自治县"]);
dsy.add("0_25_4",["和田市","和田县","墨玉县","皮山县","洛浦县","策勒县","于田县","民丰县"]);
dsy.add("0_25_5",["阿克苏市","温宿县","库车县","沙雅县","新和县","拜城县","乌什县","阿瓦提县","柯坪县"]);
dsy.add("0_25_6",["喀什市","疏附县","疏勒县","英吉沙县","泽普","莎车","叶城","麦盖提","岳普湖","伽师","巴楚","塔什库尔干塔吉克自治县"]);
dsy.add("0_25_7",["阿图什市","阿克陶县","阿合奇县","乌恰县"]);
dsy.add("0_25_8",["库尔勒市","轮台县","尉犁县","若羌县","且末县","焉耆回族自治县","和静县","和硕县","博湖县"]);
dsy.add("0_25_9",["昌吉市","阜康市","呼图壁县","玛纳斯县","奇台县","吉木萨尔县","木垒哈萨克自治县"]);
dsy.add("0_25_10",["博乐市","精河县","温泉县"]);
dsy.add("0_25_11",["伊宁市","奎屯市","伊宁县","霍城县","巩留县","新源县","昭苏县","特克斯县","尼勒克县","察布查尔锡伯自治县"]);
dsy.add("0_25_12",["塔城市","乌苏市","额敏县","沙湾县","托里县","裕民县","和布克赛尔蒙古自治县"]);
dsy.add("0_25_13",["阿勒泰市","布尔津县","富蕴县","福海县","哈巴河县","青河县","吉木乃县"]);
dsy.add("0_25_14",["石河子市","阿拉尔市","图木舒克市","五家渠市"]);

//云南
dsy.add("0_26",["昆明市","曲靖市","玉溪市","保山市","昭通市","丽江市","普洱市","临沧市","文山州","红河州","西双版纳州","楚雄州","大理州","德宏州","怒江州","迪庆州"]);
dsy.add("0_26_0",["五华区","盘龙区","官渡区","西山区","东川区","安宁市","呈贡县","晋宁县","富民县","宜良县","嵩明县","石林县","禄劝县","寻甸县"]); 
dsy.add("0_26_1",["麒麟区","宣威市","马龙县","陆良县","师宗县","罗平县","富源县","会泽县","沾益县"]);
dsy.add("0_26_2",["红塔区","江川县","澄江县","通海县","华宁县","易门县","峨山县","新平县","元江县"]);
dsy.add("0_26_3",["隆阳区","施甸县","腾冲县","龙陵县","昌宁县"]);
dsy.add("0_26_4",["昭阳区","鲁甸县","巧家县","盐津县","大关县","永善县","绥江县","镇雄县","彝良县","威信县","水富县"]);
dsy.add("0_26_5",["古城区","永胜县","华坪县","玉龙县","宁蒗县"]);
dsy.add("0_26_6",["思茅区","宁洱县","墨江县","景东县","景谷县","镇沅县","江城县","孟连县","澜沧县","西盟县"]);
dsy.add("0_26_7",["临翔区","凤庆县","云县","永德县","镇康县","双江县","耿马县","沧源县"]);
dsy.add("0_26_8",["文山县","砚山县","西畴县","麻栗坡","马关县","丘北县","广南县","富宁县"]);
dsy.add("0_26_9",["蒙自县","个旧市","开远市","绿春县","建水县","石屏县","弥勒县","泸西县","元阳县","红河县","金平县","河口县","屏边县"]);
dsy.add("0_26_10",["景洪市","勐海县","勐腊县"]);
dsy.add("0_26_11",["楚雄市","双柏县","牟定县","南华县","姚安县","大姚县","永仁县","元谋县","武定县","禄丰县"]);
dsy.add("0_26_12",["大理市","祥云县","宾川县","弥渡县","永平县","云龙县","洱源县","剑川县","鹤庆县","漾濞县","南涧县","巍山县"]);
dsy.add("0_26_13",["潞西市","瑞丽市","梁河县","盈江县","陇川县"]);
dsy.add("0_26_14",["泸水县","福贡县","贡山县","兰坪县"]);
dsy.add("0_26_15",["香格里拉县","德钦县","维西县"]);

//浙江
dsy.add("0_27",["杭州市","宁波市","温州市","嘉兴市","湖州市","绍兴市","金华市","衢州市","舟山市","台州市","丽水市"]);
dsy.add("0_27_0",["拱墅区","上城区","下城区","江干区","西湖区","滨江区","萧山区","余杭区","建德市","富阳市","临安市","桐庐县","淳安县"]); 
dsy.add("0_27_1",["海曙区","江东区","江北区","北仑区","镇海区","鄞州区","余姚市","慈溪市","奉化市","象山县","宁海县"]);
dsy.add("0_27_2",["鹿城区","龙湾区","瓯海区","瑞安市","乐清市","洞头县","永嘉县","平阳县","苍南县","文成县","泰顺县"]);
dsy.add("0_27_3",["南湖区","秀洲区","海宁市","平湖市","桐乡市","嘉善县","海盐县"]);
dsy.add("0_27_4",["吴兴区","南浔区","德清县","长兴县","安吉县"]);
dsy.add("0_27_5",["越城区","诸暨市","上虞市","嵊州市","绍兴县","新昌县"]);
dsy.add("0_27_6",["婺城区","金东区","兰溪市","义乌市","东阳市","永康市","武义县","浦江县","磐安县"]);
dsy.add("0_27_7",["柯城区","衢江区","江山市","常山县","开化县","龙游县"]);
dsy.add("0_27_8",["定海区","普陀区","岱山县","嵊泗县"]);
dsy.add("0_27_9",["椒江区","黄岩区","路桥区","温岭市","临海市","玉环县","三门县","天台县","仙居县"]);
dsy.add("0_27_10",["莲都区","龙泉市","青田县","缙云县","遂昌县","松阳县","云和县","庆元县","景宁畲族自治县"]);

//甘肃
dsy.add("0_28",["兰州市","嘉峪关市","金昌市","白银市","天水市","武威市","张掖市","平凉市","酒泉市","庆阳市","定西市","陇南市","临夏州","甘南州"]);
dsy.add("0_28_0",["城关区","七里河","西固区","安宁区","红古区","永登县","皋兰县","榆中县"]); 
dsy.add("0_28_1",["嘉峪关市"]);
dsy.add("0_28_2",["金川区","永昌县"]);
dsy.add("0_28_3",["白银区","平川区","靖远县","会宁县","景泰县"]);
dsy.add("0_28_4",["秦州区","麦积区","清水县","秦安县","甘谷县","武山县","张家川回族自治县"]);
dsy.add("0_28_5",["凉州区","民勤县","古浪县","天祝藏族自治县"]);
dsy.add("0_28_6",["甘州区","民乐县","临泽县","高台县","山丹县","肃南裕固族自治县"]);
dsy.add("0_28_7",["崆峒区","泾川县","灵台县","崇信县","华亭县","庄浪县","静宁县"]);
dsy.add("0_28_8",["肃州区","玉门市","敦煌市","金塔县","瓜州县","肃北蒙古族自治县","阿克塞哈萨克族自治县"]);
dsy.add("0_28_9",["西峰区","庆城县","环县","华池县","合水县","正宁县","宁县","镇原县"]);
dsy.add("0_28_10",["安定区","通渭县","陇西县","渭源县","临洮县","漳县","岷县"]);
dsy.add("0_28_11",["武都区","成县","文县","宕昌县","康县","西和县","礼县","徽县","两当县"]);
dsy.add("0_28_12",["临夏市","临夏县","康乐县","永靖县","广河县","和政县","东乡族自治县","积石山保安族东乡族撒拉族自治县"]);
dsy.add("0_28_13",["合作市","临潭县","卓尼县","舟曲县","迭部县","玛曲县","碌曲县","夏河县"]);

//安徽
dsy.add("0_29",["合肥市","芜湖市","蚌埠市","淮南市","马鞍山市","淮北市","铜陵市","安庆市","黄山市","滁州市","阜阳市","宿州市","巢湖市","六安市","亳州市","池州市","宣城市"]);
dsy.add("0_29_0",["庐阳区","瑶海区","蜀山区","包河区","长丰县","肥东县","肥西县"]); 
dsy.add("0_29_1",["镜湖区","弋江区","鸠江区","三山区","芜湖县","繁昌县","南陵县"]);
dsy.add("0_29_2",["蚌山区","龙子湖","禹会区","淮上区","怀远县","五河县","固镇县"]);
dsy.add("0_29_3",["田家庵","大通区","谢家集","八公山","潘集区","凤台县"]);
dsy.add("0_29_4",["雨山区","金家庄","花山区","当涂县"]);
dsy.add("0_29_5",["相山区","杜集区","烈山区","濉溪县"]);
dsy.add("0_29_6",["铜官山","狮子山","郊区","铜陵县"]);
dsy.add("0_29_7",["迎江区","大观区","宜秀区","桐城市","怀宁县","枞阳县","潜山县","太湖县","宿松县","望江县","岳西县"]);
dsy.add("0_29_8",["屯溪区","黄山区","徽州区","歙县","休宁县","黟县","祁门县"]);
dsy.add("0_29_9",["琅琊区","南谯区","天长市","明光市","来安县","全椒县","定远县","凤阳县"]);
dsy.add("0_29_10",["颍州区","颍东区","颍泉区","界首市","临泉县","太和县","阜南县","颍上县"]);
dsy.add("0_29_11",["埇桥区","砀山县","萧县","灵璧县","泗县"]);
dsy.add("0_29_12",["居巢区","庐江县","无为县","含山县","和县"]);
dsy.add("0_29_13",["金安区","裕安区","寿县","霍邱县","舒城县","金寨县","霍山县"]);
dsy.add("0_29_14",["谯城区","涡阳县","蒙城县","利辛县"]);
dsy.add("0_29_15",["贵池区","东至县","石台县","青阳县"]);
dsy.add("0_29_16",["宣州区","宁国市","郎溪县","广德县","泾县","绩溪县","旌德县"]);

//福建
dsy.add("0_30",["福州市","厦门市","莆田市","三明市","泉州市","漳州市","南平市","龙岩市","宁德市"]);
dsy.add("0_30_0",["鼓楼区","台江区","仓山区","马尾区","晋安区","闽侯县","连江县","罗源县","闽清县","永泰县","平潭县","福清市","长乐市"]); 
dsy.add("0_30_1",["思明区","海沧区","湖里区","集美区","同安区","翔安区"]);
dsy.add("0_30_2",["城厢区","涵江区","荔城区","秀屿区","仙游县"]);
dsy.add("0_30_3",["梅列区","三元区","明溪县","清流县","宁化县","大田县","尤溪县","沙县","将乐县","泰宁县","建宁县","永安市"]);
dsy.add("0_30_4",["鲤城区","丰泽区","洛江区","泉港区","惠安县","安溪县","永春县","德化县","金门县","石狮市","晋江市","南安市"]);
dsy.add("0_30_5",["芗城区","龙文区","云霄县","漳浦县","诏安县","长泰县","东山县","南靖县","平和县","华安县","龙海市"]);
dsy.add("0_30_6",["延平区","顺昌县","浦城县","光泽县","松溪县","政和县","邵武市","武夷山","建瓯市","建阳市"]);
dsy.add("0_30_7",["新罗区","长汀县","永定县","上杭县","武平县","连城县","漳平市"]);
dsy.add("0_30_8",["蕉城区","霞浦县","古田县","屏南县","寿宁县","周宁县","柘荣县","福安市","福鼎市"]);


var s=["s1","s2","s3"];
var s2=["s12","s22","s32"];

var opt0 = ["省份","地市","区县"];
var opt02 = ["省份","地市","区县"];

function setup()
{
for(i=0;i<s.length-1;i++)
document.getElementById(s[i]).onchange=new Function("change("+(i+1)+")");
change(0);

for(i2=0;i2<s2.length-1;i2++)
document.getElementById(s2[i2]).onchange=new Function("change2("+(i2+1)+")");
change2(0);
}


function change2(v) {
    var str2 = "0";
    for (i2 = 0; i2 < v; i2++) { str2 += ("_" + (document.getElementById(s2[i2]).selectedIndex - 1)); };
    var ss2 = document.getElementById(s2[v]);
    with (ss2) {
        length = 0;
        options[0] = new Option(opt0[v], opt0[v]);
        if (v && document.getElementById(s2[v - 1]).selectedIndex > 0 || !v) {
            if (dsy.Exists(str2)) {
                ar2 = dsy.Items[str2];
                for (i2 = 0; i2 < ar2.length; i2++) options[length] = new Option(ar2[i2], ar2[i2]);
                if (v) options[1].selected = true;
            }
        }
        if (++v < s2.length) { change2(v); }
    }
}